Routing Information Protocol (RIP)
Enhanced Interior Gateway Routing Protocol (EIGRP)

# RIP
Industry state

Distance vector Interior Gateway Protocol (IGP)

Hop count as metric / Bandwidth is irrelevant.

Each connection is 1. Max hop count is 15.
Almost never used in actual networks.

RIPv1, RIPv2 --> IPv4
RIPng (next gen) --> IPv6

RIP has 2 message types:
1. Request
	Ask RIP enabled routers to send their routing table
2. Response
	Send the local router's routing table to the neighbouring routers.


> RIP enabled routers share their routing tables every 30 secs. (causes congestion)


### RIPv1
No longer used.

1. only advertises classful addresses (very old concept)
2. doesn't support VLSM, CIDR
3. doesn't include subnets and forces them to be classful networks.

![[Pasted image 20240818020500.png]]

4. messages are broadcast to 255.255.255.255 

### RIPv2

1. supports VLSM, CIDR
2. includes subnet mask info in adverts
3. messages are *multicast* to 224.0.0.9

![[Pasted image 20240818020623.png]]


# RIP config

The topology we'll use: 

![[Pasted image 20240818020646.png]]
// we shall configure R1, and assume all the others are RIP configured.

		R1(config)# router rip
//enable RIP

		R1(config-router)# version 2
// just to make sure that RIPv2 is being used

		R1(config-router)# no auto-summary
// stops networks from being converted to classful networks. This is on by default , so disabling is of utmost important.

		R1(config-router)# network 10.0.0.0
// this is a classful command, and this is a class A network. Even if 10.0.12.0 is used, it'll be converted to 10.0.0.0/8.
Due to this, there is no need to enter the network mask , because it is useless.

![[Pasted image 20240818021237.png]]

The *network* command doesn't tell the router which networks to advertise. It tells the router which interfaces to activate RIP on (interfaces whose IP prefix bits match) and then the router will advertise the network prefix OF THOSE INTERFACES:

![[Pasted image 20240818021401.png]]


![[Pasted image 20240818021628.png]]

![[Pasted image 20240818021641.png]]

		R1(config-router)# passive-interface <interface-id> 
// configures g2/0 to be a passive interface

![[Pasted image 20240818021749.png]]

![[Pasted image 20240818021835.png]]

![[Pasted image 20240818021911.png]]
// The command to share this information about the default gateway to other RIP enabled routers is:

		R1(config-router)# default-information originate

![[Pasted image 20240818022042.png]]
// R4 will load balance traffic over the 2 routes, since they are both equivalent to its metric. OSPF also has this command for its default gateway

## show ip protocols command

Can be used for rip, eigrp and ospf to check various stats:

![[Pasted image 20240818022210.png]]
//distance is the admin dist for RIP. To change it:

		R1(config-router)# distance <number>
//same for eigrp and OSPF
![[Pasted image 20240818022622.png]]



// To configure more than 4 max ECMP paths: 

		R1(config-router)# maximum-paths <number>
//command is the same for eigrp and OSPF

![[Pasted image 20240818022405.png]]


# EIGRP

Enhanced Interior Gateway Routing Protocol

Somewhere between CISCO proprietary and open source.

Does not have the 15 count limit of RIP.

Sends messages using multicast address of 224.0.0.10

![[Pasted image 20240818022823.png]]
(more traffic over higher bandwidth paths)


## config

		R1(config)# router eigrp <Autonomous-system-number>
// enable eigrp.

		R1(config-router)# no auto-summary
// disable the auto summary feature for safety

		R1(config-router)# passive-interface <interface-id>
// to disable eigrp on end host connected interfaces

		R1(config-router)# network <address> <wildcard-mask>
// this one is NOT classful if the netmask is specified. If not, then it becomes classful.

![[Pasted image 20240818023205.png]]// the mask looks weird, because eigrp uses a *wildcard mask*.

![[Pasted image 20240818023340.png]]

### show ip protocols 
When eigrp is enabled

![[Pasted image 20240818023755.png]]// Bandwidth of the slowest link in the path + the delay values of all the links in the path = the metric

k2, 3 and 5 are 0 by default.

**//In eigrp and OSPF the router has a unique ID in the Autonomous system**

Router ID order of priority:
1. Manual configuration
2. Highest IP address on a loopback interface
3. Highest IP address on a physical interface

// just a 32 bit number formatted similar to an IP addr.

can be changed by:

![[Pasted image 20240818024101.png]]

### How eigrp looks like in the routing table

> The letter assigned to Eigrp is *D .


![[Pasted image 20240818024317.png]]




