Not automatically added to the routing table and must be manually configured. 

# The network we're dealing with
![[Pasted image 20240804191744.png]]
// same as the last lessons

Here we'll configure R2.

![[Pasted image 20240804191853.png]]

// Configuring the IP addr for g0/0 and g0/1
// Enabled both interfaces. (if an interface is DISABLED the C and L routes for it DO NOT appear in the routing table, they only appear when the interface is enabled.)

![[Pasted image 20240804192336.png]]

**Configuration for R3**

![[Pasted image 20240804192445.png]]

**R4 Configuration**

![[Pasted image 20240804192527.png]]

# Configuring the devices so that PC 1 and PC 4 can communicate

![[Pasted image 20240804192803.png]]

// pc1 and pc4 are Linux hosts, with default interface names as eth0.

### Default Gateway
For end hosts to send packets to destinations OUTSIDE of their local network, they must send packets to their *default gateway.*

Gateway is an OLD TERM FOR A ROUTER. Default gateway, then, means the router. Default gateway config is also known as Default Route.

It is a route to 0.0.0.0/0 (all netmask bits set to zero.)
This means any and all traffic will pass through this , since it includes all addr from 0.0.0.0 - 255.255.255.255
This is the LEAST SPECIFIC ROUTE POSSIBLE, and hence what doesn't go into other routes, it goes here, instead of getting dropped.

The configurations for pc1 and pc4

![[Pasted image 20240804193212.png]]

END HOSTS usually do NOT need any more specific routes. Since all they need to know is that "to send packets OUTSIDE by local network, I must send them through the default gateway."

![[Pasted image 20240804193719.png]]

When loads have multiple paths they can travel through to get to their destination, these paths can be configured to:
1. Load balance
2. One is used as a backup path

// More on these later.

*HERE WE ARE USING THE ROUTE R1-->R3-->R4, INSTEAD OF R2.*

Routes that are not already Connected routes, will have to be manually configured.

By looking at the network topology, we can plan a table before beginning to configure Static Routes.

![[Pasted image 20240804194741.png]]

// Now, to allow for communication between PC1 and PC4, we'll configure these static routes on R1, R3 and R4.

> Code for Static Routes is **S**.
# Configuring the Routes

//On r1

To configure a Static Route the command is

		R1(config)# ip route ip-address netmask next-hop

![[Pasted image 20240804195159.png]]

OR we can configure it using the interface it must send the traffic out of

		R1(config)# ip route ip-address netmask exit-interface

![[Pasted image 20240804200324.png]]

We can also specify both the exit-interface and the next-hop.

		R1(config)# ip route ip-address netmask exit-interface next-hop

![[Pasted image 20240804200502.png]]



Once configured, it shows up as:

//On r1
![[Pasted image 20240804195232.png]]

The {1/0} displayed in the routes means:

Administrative Distance/Metric

//more on them later

Ping is a good way to check for Configuration success, because if the there is NO TWO WAY REACHABILITY, the ping fails.

// On r2

![[Pasted image 20240804200547.png]]
// look at how it displays "192.168.1.0/24 is directly connected" , when only the exit-interface is configured, even though the network is NOT directly connected.

It is better to specify the next-hop only, or both interface and next-hop, because exit-interface only configured static routes rely on a feature called *Proxy Arp* to function, and as a netadmin, you should lessen chances of problems as much as possible.

> Look at Proxy ARP on your own time, out of scope of the exam.
### A packet travelling from pc1 to pc4

// Will be examined in more detail later.

![[Pasted image 20240804195932.png]]

// The source and dest IP ADDR of the packet do NOT CHANGE during the entire journey.

// However, each time the packet is encapsulated and de-encapsulated, the source and dest MAC ADDR of the packet DO CHANGE.

****

# Some more things about Default Routes

![[Pasted image 20240804201219.png]]

![[Pasted image 20240804201333.png]]

*Gateway of last resort is not set* means that no default route has been configured yet.

### Configuring a default route 

It is the same as any other static route, except that the network and the netmask are both 0.0.0.0

![[Pasted image 20240804201525.png]]

// The * means that the gateway is a candidate to being the router's default route. There can be multiple default gateway candidates as well.

