Virtual Local Area Network (separate end hosts at Layer 2, logically)
 
# LAN
A LAN is a single broadcast domain, including all devices in that broadcast domain.

#### Broadcast Domain
Group of devices which will receive a broadcast frame (Dest MAC addr ffff.ffff.ffff) sent by any one of the members.

Example:

![[Pasted image 20240810084101.png]]
// 4 broadcast domains in this network, therefore 4 LANs

# VLANs

> Lots of unnecessary broadcast traffic reduces network performance.

> Security issues also arise, when there are unrestricted broadcasts within an organisation as well.

VLANs are configured on switches on a per-interface basis.
VLANs logically separate end hosts at layer 2.

![[Pasted image 20240810084407.png]]
// So we might go ahead and subnet the organisation's networks like so.

However, if a frame is a broadcast frame, the switch will still flood it to all the departments (all the subnets, because subnets do NOT matter to a switch.)

Solutions:

1. Buy a switch for every department (not very economically viable)
2. Use VLANs

--> We configure the Switch Interfaces to be on a separate LAN (VLAN) and the switch will then consider each VLAN to be a separate LAN and will not forward traffic between VLANs, including broadcast/known unicast traffic.

A router will be used to route between VLANs. Switches DO NOT perform inter-VLAN routing.

### How a packet will travel when VLANs are configured

PC1 (on VLAN 10) wants to send a packet to PC2 (on VLAN 30)

![[Pasted image 20240810085107.png]]
// PC1 Sends the packet to the switch

// The switch sends it to the Router R1

![[Pasted image 20240810085226.png]]

// The router changes the source and destination MAC addresses.

// The router send the packet back to the switch, which then forwards it to PC2.

> Notice carefully that the traffic that arrives on a VLAN 10 interface on the switch, is forwarded out of a VLAN 10 interface (orange).
> Similarly, traffic that arrives on a VLAN 30 interface, exits from a VLAN 30 interface (purple).


# VLAN Configuration
This is how we'll configure the network into VLANs.

![[Pasted image 20240810085814.png]]

##### 1. show vlan brief command

		Sw1# show vlan brief

VLAN 1 --> Default 
is the VLAN that all interfaces are assigned to by default.

![[Pasted image 20240810085924.png]]

VLANs 1, 1002, 1003, 1004 and 1005 exist by default and cannot be deleted.

##### 2. assigned ports to VLANs

		SW1(config)# interface range g1/0 - 3

// select multiple interfaces at once

		SW1(config-if-range)# switchport mode access

// sets the interface as an access port

> Access Port:
> 	A switchport which belongs to a single VLAN and usually connects to end hosts like PCs.
> Gives the end hosts "access" to the network, thus the name.

> Trunk Ports:
> 	Switch ports that carry multiple VLANs.


		SW1(config-if-range)# switchport access VLAN10

// creates the specified VLAN if it doesn't exist and assigns the port (or the range of ports) to the VLAN.

![[Pasted image 20240810090738.png]]

##### 3. Checking the config

		SW1(config)# do show vlan brief

![[Pasted image 20240810090845.png]]

// We can assign these VLANs better and more descriptive names.

		SW1(config)#vlan 10
	
//selects the appropriate VLAN

		SW1(config-vlan)#name ENGINEERING
//the "name" field of the selected VLAN is altered.

We then do the same for the other VLANs

		SW1(config)#vlan 20

		SW1(config-vlan)#name HR

		SW1(config)#vlan 30

		SW1(config-vlan)#name SALES


Now, we check the config one last time

		SW1(config)# do show vlan brief

![[Pasted image 20240810091323.png]]

# Trunk Ports

The network topology we'll use here: 

![[Pasted image 20240810104829.png]]

In small networks, it's alright to use a separate interface for each VLAN, however, it doesn't scale well for Large connections.

Trunks are used to carry traffic from multiple VLANs. (Single physical connections)

How the topology above translates to Trunks:

![[Pasted image 20240810105217.png]]


##### How does a Switch know which VLAN the traffic belongs to?

The answer is *tagging*. 
Switches will tag all frames they send over a trunk; this allows the receiving switch to know which VLAN the frame belongs to.

In fact, Trunk ports are also known as *tagged ports* and Access Ports are *untagged ports*.


### VLAN tagging

There are 2 main trunking protocols:
1. ISL (inter switch link) --> Old CISCO proprietary protocol (probably never used in the real world anymore)
2. IEEE 802.1Q (dot1q) --> Standard

# dot1q 

Inserts a 4 byte tag field in the ethernet header.

![[Pasted image 20240810105804.png]]
// normal ethernet header


![[Pasted image 20240810105836.png]]
//Ethernet Header with 4 byte tag field inserted.

## dot1q tag

4 bytes in length (32 bits)

Consists of 2 main fields:
1. TPID (Tag Protocol Identifier)
2. TCI (Tag Control Information) --> TCI consists of three sub fields.
	1. PCP -- > 3 bits
	2. DEI --> 1 bit
	3. VID --> 12 bits 

![[Pasted image 20240810110121.png]]


### TPID field

16 bits (2 bytes in length)

Always set to 0x8100. 
This indicates that the frame is 802.1Q tagged

### PCP Field ( Priority Code Point)

Length --> 3 bits

Used for Class of Service (CoS) --> Prioritizes important traffic in congested networks.


### DEI ( Drop Eligible Indicator )

Length -->  1 bit

Used to indicate frames that CAN BE DROPPED if the network is congested. (makes sure that more important network traffic gets through)

### VID (VLAN ID)

Length --> 12 bits

Identifies the VLAN the frame belongs to.

Since it is 12 bits in length, that means that there are a possible $2^{12}$ = 4096 VLANs possible. 
	VLANs 0 and 4095 are however, reserved and cannot be used.

(ISL also has a VLAN range of 1-4094)

## VLAN Ranges

Normal VLANs --> 1 - 1005
Extended VLANs --> 1006 - 4094

**Some older devices might NOT support the extended range, however, most modern devices do**

## Native VLAN

(A feature in dot1q, NOT in ISL)

Native VLAN is 1 on all trunk ports, however this can be manually configured on each trunk port. 
HAS TO BE CONFIGURED ON EACH TRUNK PORT SEPARATELY.

Switches DO NOT ADD A 802.1Q tag to frames in the native VLAN. This means it is VERY IMPORTANT THAT THE NATIVE VLAN MATCHES ON THE SWITCHES. (Because when a switch receives an untagged frame on a trunk port, it assumes the frame belongs to the native VLAN)


# Trunk Configuration

![[Pasted image 20240810111542.png]]

// This is the network to configure.


		SW1(config)# interface g0/0

//we select the relevant interface

		SW1(config-if)# switchport mode trunk
//similar to switchport mode access, but trunk, since this is a trunk port

--> Here, we might get an error on some devices (which support both ISL and dot1q), saying:

*Command rejected: An interface whose trunk encapsulation is "Auto" can not be configured to "trunk" mode.*

Here we must manually set the encapsulation to dot1q.

		SW1(config-if)# switchport trunk encapsulation dot1q
// configures the encapsulation protocol to dot1q

		SW1(config-if)# switchport mode trunk
// now this works and sets the g0/0 port as trunk.

![[Pasted image 20240810112223.png]]

		SW1# show interfaces trunk
// to check trunk ports' status

![[Pasted image 20240810112304.png]]
We can configure which VLANs to allow on a trunk. By default, all are, but it helps with network performance and security if we explicitly specify. We shall do that now


		SW1(config)# int g0/0
//select the interface

		SW1(config-if)# switchport trunk allowed vlan 10,30
// We added the vlan using the VLAN ID here
// There are different options available to do so

![[Pasted image 20240810112729.png]]
remove --> removes the specified vlan from the allowed list
all --> obvious
except --> all vlans allowed except the specified ones
none --> obvious, but disables all VLANs (no traffic now passes over the trunk)

		Sw1#show interfaces trunk
//to check on the status of things

![[Pasted image 20240810113015.png]]


> NOTE:
> 	For network security purposes it is best to change the NATIVE VLAN to an *UNUSED VLAN*.More on this later.
> **Just make sure that this native VLAN matches across all switches.**


##### Changing the Native VLAN

		SW1(config-if)# switchport trunk native vlan <vlan number here>
// use this when the trunk interface is already selected (g0/0 in our case here)

![[Pasted image 20240810113416.png]]

> Note:
> 	The *show vlan brief* command shows the ACCESS PORTS assigned to each VLAN.
> 	Use *show interfaces trunk* command to confirm the trunk ports and which VLANs they allow.

##### Configuring Switch 2

![[Pasted image 20240810113644.png]]

![[Pasted image 20240810113701.png]]

# Router Configurations (ROAS)

Previously, we had different interface devices for each LAN on R1.
Now, since that does not exist, we must use *sub interfaces* on R1.

![[Pasted image 20240810113941.png]]

ROAS(Router on a Stick) is the name given to this method of inter VLAN routing. 

As can be seen from the diagram, there is only 1 physical interface b/w SW2 and R1. However, we can divide this one physical interface into 3 separate sub interfaces.

It would then look like this: 

![[Pasted image 20240810114228.png]]

These 3 logical sub interfaces are the same physical interface. 
We do not need to configure anything other than the standard trunk config on the switch to use ROAS config.

Moving on to the router config:

		R1(config)# interface g0/0
//select the interface

		R1(config-if)# no shutdown
// since router interfaces are disabled by default, we're turning this one on.

		R1(config-if)# interface <interfacenum>.<subinterfacenum>
// this is how we enter the subinterface config number.

The subinterface number isn't mandatorily required to match the VLAN number, BUT IT IS RECOMMENDED AND GOOD PRACTICE TO MAKE THEM MATCH.

		R1(config-if)# interface g0/0.10
// select the sub-interface

		R1(config-subif)# encapsulation dot1q <vlannum>
// tells the router to treat any arriving frames tagged with the dot1q vlan number, as if they arrived on this subinterface.
Also tags all frames leaving this subinterface with VLAN 10 using dot1q.

		R1(config-subif)# ip address <ip address> <netmask>
//assigns an IP addr to the subinterface

![[Pasted image 20240810115104.png]]

Now we configure the other 2 subinterfaces

![[Pasted image 20240810115140.png]]

And we check the configurations with

		R1# show ip int brief

![[Pasted image 20240810115234.png]]

And to check the routing table: 

		R1# show ip route

![[Pasted image 20240810115325.png]]

# Native VLAN on a Router

The benefit of using a native VLAN is that since the frames do NOT have to be tagged, each frame is smaller and as such the device can send more frames per second.

There are 2 ways to configure native VLAN on a router:
1. use the command *encapsulation dot1q \< vlan-id \> native* on the router subinterface
	![[Pasted image 20240811002138.png]]

2. configure the IP addr for the native VLAN on the router's physical interface (in this case the 1st command is NOT necessary)

# Using Wireshark on this network in the topology SW2 to R1

![[Pasted image 20240811102637.png]]

ICMP echo req from SW2 to R1

![[Pasted image 20240811103039.png]]

// Type --> TPID 
// the other 3, pcp (3) , dei (1) and vlid(12) are grouped together
// Normal Type field after that


## Configuring Native VLAN on a router using the IP addr on the router's physical interface

##### 1. no interface

command deletes the subinterface

		R1(config)# no interface g0/0.10

##### 2. enter interface config mode

		R1(config)# interface g0/0

##### 3. Configure the IP addr for the native vlan on the interface

		R1(config-if)# ip address 192.168.1.62 255.255.255.192

![[Pasted image 20240813132044.png]]

This configures the Native VLAN similar to VLAN 10, just without specifying the name "vlan 10".

##### 4. check using show running config

![[Pasted image 20240813132159.png]]

// The default IP addr of the interface is then that of the native vlan. The other 2 vlans (20 and 30) work as usual (and will be tagged)


**However, it's recommended to set the native vlan to an unused VLAN for security purposes.**

# Multilayer Switch (layer 3 switch)

![[Pasted image 20240813132415.png]]

The official CISCO icons for a layer 2 and layer 3 switch are:

![[Pasted image 20240813132531.png]]

A Multilayer switch is capable of BOTH SWITCHING AND ROUTING. They have both a MAC addr table and an ARP table.

It is "layer 3 aware", unlike the normal layer 2 switch, that has no conception of a layer 3 existing.

Multilayer switches can have "routed" ports (IP addr can be assigned to its interfaces , like a router.) 

Virtual interfaces can be assigned for each VLAN for a single physical interface as well. And routes can be configured on a multilayer switch, just like a router.

Finally, they're used for inter-VLAN routing, as the preferred method in Large networks.


# Switch Virtual Interfaces

SVIs are the virtual interfaces we can assign IP addr to in a multilayer switch. This removes the need for a router to route the traffic amongst VLANs inside a LAN.


> We configure each end host to use the SVI (*and not the router*) as their gateway address. --> Like when using ROAS (router on a stick)

![[Pasted image 20240813162754.png]]
# Configuring Layer 3 switches


### General Configs

1. Select the relevant interface and reset it to its default settings (g0/1 in this case)

		SW2(config)# default interface g0/1

2. Enable Layer 3 routing on the switch

		SW2(config)# ip routing

3. Now select and enter interface config mode

		SW2(config)# interface g0/1 

4. Now configure the interface as a routing port and not a layer 2 switchport

		SW2(config-if)# no switchport

5. Now assign an IP addr to the interface, like a normal *router* interface.

		SW2(config-if)# ip address <address> <netmask>

6. Check with the show ip int br command

		SW2(config-if)# do show ip interface brief 


![[Pasted image 20240813164340.png]]

7. Finally, configure the Default route to R1 (for LAN outbound traffic)

		SW2(config-if)#exit
// exits interface config mode

		SW2(config)# ip route 0.0.0.0 0.0.0.0 192.168.1.194

8. Use show ip route command to confirm
![[Pasted image 20240813164701.png]]

An additional command that can be used to confirm is *show interfaces status*

![[Pasted image 20240813164747.png]]

### Configuring SVIs

1. Select the interface along with the vlan

		SW2(config)#interface vlan10

2. Then assign the IP

		SW2(config-if)# ip address <ip addr> <netmask>

3. enable using *no shutdown*

		SW2(config-if)# no shutdown

*Remember to use the no shutdown command, because SVIs are **shutdown** by default.*

![[Pasted image 20240813170131.png]]

// Configured successfully.

#### What happens if we try to configure a SVI for a vlan that does not exist?

Vlan40 in this case.

![[Pasted image 20240813170346.png]]

The VLAN isn't up-up.

If an accessed port is assigned to a VLAN that does not yet exist on the switch, the switch will AUTOMATICALLY create the VLAN.

**However, if you do the same for an SVI, the switch will NOT automatically create the VLAN.**

Also, the switch MUST HAVE:

1. at least one access port in the VLAN in the up/up state. And/Or
2. One trunk port that allows the VLAN that is in an up/up state.

The vlan must NOT be shutdown.

The SVI itself should not be shutdown.








