Allows us to group multiple physical interfaces into a group that operates as a single logical interface, they behave as if they are one interface.


ASW --> Access Layer Switch , a switch that end hosts connect to

DSW --> Distribution Layer Switch, a Switch that Access Layer Switches connect to

![[Pasted image 20240817202044.png]]

// The connection b/w ASW1 and DSW1 is congested

> Oversubscription:
> 	Bandwidth of the interfaces connected to the end hosts is greater than the bandwidth of the connection to the distribution switch/switches.
> 	Some oversubscription is acceptable, too much causes network congestion.

  To mitigate this, more connections are added.

![[Pasted image 20240817202319.png]]

// The connection is still congested, since only 1 link is being used as the actual connection, the others are disabled (as done in STP)

However, if all 4 of these physical interfaces can be grouped together into a single logical interface, providing much higher bandwidth.

![[Pasted image 20240817202559.png]]

// The circle is a representation of Etherchannel making these 4 physical interface a single logical interface.

// The traffic is load balanced b/w all the interfaces using an algorithm.

Etherchannel AKA:
1. Port Channel
2. LAG (Link Aggregation group)

## How etherchannel load balances

1. Balances based on "flows"

A flow is a communication b/w 2 nodes on a network.

Frames in the same flow, will be forwarded using the same physical interface. This is to prevent frames from arriving out of order.


Inputs to the algorithm for interface selection calc can be changed.

Inputs that can be used:
1. Source MAC
2. Dest MAC
3. Source AND dest MAC
4. Source IP
5. Dest IP
6. Source AND dest IP

//  With methods the switch can use, depends on the model of the switch.

# Configuring EtherChannel

		ASW1# show etherchannel load-balance
// to see the current load balancing method.]

![[Pasted image 20240817203548.png]]

		ASW1(config)# port-channel load-balance <option>
// to change load balancing config parameters.

![[Pasted image 20240817203724.png]]


![[Pasted image 20240817203710.png]]

There are 3 methods of EtherChannel config on CISCO switches:

1. PAgP(Port Agg Protocol)
	CISCO propreitary
	Dynamically negotiates the creation/maintenance of the EtherChannel ( like DTP does for trunks)

2. LACP (Link Agg Control Protocol)
	Industry standard (IEEE 802.3ad)
	Dynamically negotiates creation/maintenance of the EtherChannel 
	More preferred

3. Static EtherChannel
	Not preferred
	A protocol isn't used to determine if an etherchannel should be formed.

> Up to 8 interfaces can be formed into a Single EtherChannel
> (16 allowed for LACP, BUT 8 are on standby mode, so effectively only 8 are working)


# PAgp Config

		SW(config)# interface range g0/0 - 3
//select interface range

		SW(config-if-range)# channel-group mode <req mode here>
// select the etherchannel mode (PAgP, LACP etc)
// similar wording to DTP

![[Pasted image 20240817204315.png]]

![[Pasted image 20240817204607.png]]

![[Pasted image 20240817204648.png]]

# LACP Config

simply change the mode name to Active/ Passive mode

![[Pasted image 20240817204739.png]]

# Static Etherchannel

mode name: on

On only works with on mode.


**After the etherchannel is configured, the portchannel itself can be configured as how we would configure a single int.**

![[Pasted image 20240817205056.png]]

# Important Point for Etherchannel

![[Pasted image 20240817205149.png]]

### Checking Etherchannel

		SW# show etherchannel summary

![[Pasted image 20240817205244.png]]
// this is how a desirable config should look like (the flags sepcifically)

		 SW# show etherchannel port-channel
// another way to get a summary


> Only the portchannel interface is shown in the *show spanning tree* command

![[Pasted image 20240817205525.png]]
// if all connections are made using Routed Ports, STP is not needed at all, since routed ports DO NOT forward layer 2 broadcasts.

( we config routed ports with a no switchport command)

# Configuring Layer 3 etherchannel

![[Pasted image 20240817205740.png]]
// this is the topology

![[Pasted image 20240817205800.png]]

# Commands Summary

![[Pasted image 20240817205940.png]]





